-- Відділення (Departments)
-- ■ Ідентифікатор (Id). Унікальний ідентифікатор відділення.
-- ▷ Тип даних — int.
-- ▷ Автоприріст.
-- ▷ Не містить null-значення.
-- ▷ Первинний ключ.
-- ■ Корпус (Building). Номер корпусу, в якому знаходиться
-- відділення.
-- ▷ Тип даних — int.
-- ▷ Не містить null-значення.
-- ▷ Має бути в діапазоні від 1 до 5.
-- ■ Фінансування (Financing). Фонд фінансування відділення.
-- ▷ Тип даних для зберігання грошових значень.
-- ▷ Не містить null-значення.
-- ▷ Не може бути менше, ніж 0.
-- ▷ Значення за замовчуванням — 0.
-- ■ Назва (Name). Назва відділення.
-- ▷ Тип даних — varchar(100).
-- ▷ Не містить null-значення.
-- ▷ Не може бути порожньою.
-- ▷ Має бути унікальною


CREATE TABLE DEPARTMENTS (
	DEPARTMENT_ID SERIAL NOT NULL PRIMARY KEY,
	BUILDING INT NOT NULL CHECK(BUILDING BETWEEN 1 AND 5),
	FINANCING INT  NOT NULL CHECK(FINANCING >= 0),
	DEPARTMENT_NAME VARCHAR(100) NOT NULL UNIQUE
);

INSERT INTO DEPARTMENTS (BUILDING, FINANCING, DEPARTMENT_NAME) VALUES
(1, 500000, 'Кардіологія'),
(2, 350000, 'Неврологія'),
(3, 200000, 'Хірургія'),
(4, 150000, 'Терапія'),
(1, 400000, 'Педіатрія'),
(5, 180000, 'Ортопедія'),
(2, 250000, 'Акушерство та гінекологія');

SELECT *
FROM DEPARTMENTS;








